[
  {
    "title": "Who I Am",
    "text": "After a fulfilling career as a high school math teacher, I pivoted to embrace a new profession as an Interior Decorator. While on paper, they may seem like opposite ends of the spectrum, in Design School, details such as accurate measurements, scale diagrams and budgets are key. As it turns out, math and design are complementary skills. It's not just about choosing beautiful fabrics and fixtures, though that can be fun too!"
  },{
    "title": "How I came to Design",
    "text": "My passion for design was sparked by the experience of growing up in a home with a love of art, DIY and an appreciation for antiques. Fast forward to my own home, with a major renovation looming, we hired a design professional for guidance and it was the best money we spent – now we had a plan."
  },{
    "title": "My Design Philosophy",
    "text": "Design should be both functional and practical as well as beautiful and inspiring. Interior design is not an abstract concept – it's about how you use the space; it's about the way you interact with the space, and ultimately, how you feel in it. It's about family and friends; it's the backdrop to your life. Your rooms should reflect your individuality and contain the things that anchor your lives and bring you joy, pleasure and comfort."
  },{
    "title": "My Promise to You",
    "text": "I love creating a space that truly reflects your style and space needs. As a design professional, my role is to help take the stress out of creating a home that reveals who you are and how you live. My promise is to work with you to make the best decisions for quality and value while respecting your design esthetic and budget."
  },{
    "title": "My Design Background",
    "text": "As a member of DDA (Decorators & Designers Association of Canada), I follow industry-best standards and is up to date on the latest developments by fulfilling yearly continuing education requirements. I am a high honours graduate of the Interior Decorating program at Sheridan College and worked for a number of other design firms for many years before embarking on my own."
  }
]