[
  {
    "title": "Initial Consultation",
    "descr": "After a short phone interview, a 2-hour personalized in-home visit is scheduled. This can be a stand along meeting or serve as the start of a design project, where I help you create a vision for the space and ideas for furniture placement, colours and accessories. This is a perfect start for a DIY home owner.",
    "cost": "$300 + HST. Travel may be extra.",
    "img": "consult.jpg"
  },{
    "title": "Design Concept & Development",
    "descr": "I look forward to working collaboratively with you to create a soothing or stimulating environment. From room layout to custom sourced furniture and fabric selections, art and accessories, I help make your dream room come true.<br>Measurements are taken and a 3D virtual room is created to simulate the space and selections so you can ‘see and feel’ what one room will look like. A spread sheet with pricing and furniture details with dimensions is included. All selections are confirmed by the client after a 1-2 hour in house presentation with fabric samples. When necessary, Dianna will meet the client for a sit test of furniture to confirm the best comfort and fit at a trade only location for best pricing and wide selection. At this point, clients can choose to proceed on their own. Typically 18-20 hours are required for a virtual room with suggested selections.",
    "cost": "$1500 + HST.",
    "img": "design.jpg"
  },{
    "title": "Install & Completion",
    "descr": "After clients have confirmed all selections, pricing and the furniture layout after the presentation, Dianna works to implement the plan including placing orders, tracking items and arranging deliveries. This phase of the design process is charged at an hourly rate of $90/hr. Any discounts are shared with the client which often offset the design costs. On reveal day, extra styling items are brought in to finish the space and show a fully styled room. These items complete the look and are optional for the client to purchase at cost.",
    "cost": "$90/h",
    "img": "install.jpg"
  }
]