[
  {
    "name": "Dana",
    "text": "Dianna was most helpful and skillful with a range of ideas and suggestions and we both seem to meld and agree with the same ideas of the decor/design for our home. We are very happy and contented with the end result! We Highly recommend Dianna",
    "date": "2020"
  },
  {
    "name": "Sheila & Duane",
    "text": "We recently moved after 30 years and found ourselves in a new home with lots of \"empty spaces\". Working with Dianna was very enjoyable. She was able to combine our ideas and vision with her experiences and expertise to come up with some great plans for our new home. We really appreciated her patience with us as we changed our minds a few times during the project. Professional and pleasant would be a great way to describe Dianna. We were very pleased with the work she did for us.",
    "date": "2020"
  },
  {
    "name": "Whitney",
    "text": "I've worked with Dianna doing some design projects around my home and it's been a pleasure. Dianna is excellent at keeping projects in budget and on time. If revisions needed to be made, they were always done promptly. She has a natural eye for design and can see things in a space that I was dumbfounded about. I would absolutely work with Dianna in any upcoming design plans; having her insight has saved my mistakes from happening!",
    "date": "2019"
  },
  {
    "name": "Paul",
    "text": "My accommodation is a unique master bedroom in a large shared home, and with it looking like I would be staying there for a while I really felt the need to make it homier and more suited to my personality. Having seen so many house design TV shows, I really felt that getting a professional was worth the money, and knew that Dianna had branched into that field after she retired from teaching. I reached out to her and was really happy with the results. I didn't have a huge budget, and she was able to suggest a lot of options that quickly and inexpensively transformed my space. Her in-person consultation and guidance through the purchasing process was extremely helpful, and the end result was even better than I had hoped. Her expertise, combined with her professional but friendly personality made it a very rewarding experience.",
    "date": "2019"
  },
  {
    "name": "Swati",
    "text": "We bought our first home – a condo – when my daughter was barely 5 months old. As new parents in brand new territory, we really leaned heavily on Dianna's judgement and experience to turn our condo into a home that worked for us and our baby. Dianna, not just delivered on our modest budget, but also far exceeded our expectations. She truly turned our home into an aesthetic, comfortable and practical space that worked for our daughter, socializing and down time. Too often one Googles top-notch interior designers only to find a repetitive all-white look, with the same \"on-trend\" accessories. Dianna was great at steering clear of trends, and designing a space that looked like our own.",
    "date": "2018"
  },
  {
    "name": "Karen",
    "text": "We retained Dianna's design services a couple of times for direction on our main floor living room and with our teens' bedrooms. In all cases, we were looking for budget friendly ideas to pull the rooms together without having to replace the big furniture pieces. With her eye for art and accessorizing, and following up on her suggestions for colour, bedding and furniture, we love the final rooms. She arrived totally prepared and we could not have done this without her help.",
    "date": "2018"
  }
]